; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	infrared1 - mode
	thermograph2 - mode
	thermograph0 - mode
	thermograph3 - mode
	Star1 - direction
	Star0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument8 thermograph3)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 Star4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite0 Planet21)
	(pointing satellite2 Planet20)
	(have_image Star5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 thermograph0)
	(have_image Planet9 infrared1)
	(have_image Star11 thermograph3)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 thermograph2)
	(have_image Star14 thermograph3)
	(have_image Phenomenon15 thermograph3)
	(have_image Planet16 thermograph2)
	(have_image Planet17 thermograph3)
	(have_image Phenomenon18 infrared1)
	(have_image Star19 thermograph3)
	(have_image Planet20 thermograph0)
	(have_image Planet21 infrared1)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 18
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 18
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 18
4. (turn_to satellite4 star4 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star4)
   goals met: 0 of 18
5. (calibrate satellite4 instrument9 star4)
   added: (calibrated instrument9)
   goals met: 0 of 18
6. (turn_to satellite4 phenomenon15 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 18
7. (take_image satellite4 phenomenon15 instrument9 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 1 of 18
8. (turn_to satellite4 planet17 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet17)
   goals met: 1 of 18
9. (take_image satellite4 planet17 instrument9 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 2 of 18
10. (turn_to satellite4 star11 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 star11)
   goals met: 2 of 18
11. (take_image satellite4 star11 instrument9 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 3 of 18
12. (turn_to satellite4 star14 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star14)
   goals met: 3 of 18
13. (take_image satellite4 star14 instrument9 thermograph3)
   added: (have_image star14 thermograph3)
   goals met: 4 of 18
14. (turn_to satellite4 star19 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star19)
   goals met: 4 of 18
15. (take_image satellite4 star19 instrument9 thermograph3)
   added: (have_image star19 thermograph3)
   goals met: 5 of 18
16. (turn_to satellite3 planet20 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet20)
   goals met: 5 of 18
17. (turn_to satellite3 star2 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star2)
   goals met: 5 of 18
18. (calibrate satellite3 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 5 of 18
19. (turn_to satellite3 planet20 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet20)
   goals met: 5 of 18
20. (take_image satellite3 planet20 instrument8 thermograph0)
   added: (have_image planet20 thermograph0)
   goals met: 6 of 18
21. (turn_to satellite3 star8 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 star8)
   goals met: 6 of 18
22. (take_image satellite3 star8 instrument8 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 7 of 18
23. (turn_to satellite2 planet20 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet20)
   goals met: 8 of 18
24. (turn_to satellite1 star0 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star0)
   goals met: 8 of 18
25. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 8 of 18
26. (turn_to satellite1 phenomenon12 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon12)
   goals met: 8 of 18
27. (take_image satellite1 phenomenon12 instrument2 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 9 of 18
28. (turn_to satellite1 phenomenon13 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon13)
   goals met: 9 of 18
29. (take_image satellite1 phenomenon13 instrument2 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 10 of 18
30. (turn_to satellite1 phenomenon18 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon18)
   goals met: 10 of 18
31. (take_image satellite1 phenomenon18 instrument2 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 11 of 18
32. (turn_to satellite1 phenomenon7 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon7)
   goals met: 11 of 18
33. (take_image satellite1 phenomenon7 instrument2 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 12 of 18
34. (turn_to satellite1 planet16 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet16)
   goals met: 12 of 18
35. (take_image satellite1 planet16 instrument2 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 13 of 18
36. (turn_to satellite1 planet21 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet21)
   goals met: 13 of 18
37. (take_image satellite1 planet21 instrument2 infrared1)
   added: (have_image planet21 infrared1)
   goals met: 14 of 18
38. (turn_to satellite1 planet6 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 planet6)
   goals met: 14 of 18
39. (take_image satellite1 planet6 instrument2 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 15 of 18
40. (turn_to satellite1 planet9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet9)
   goals met: 15 of 18
41. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 16 of 18
42. (turn_to satellite1 star5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star5)
   goals met: 16 of 18
43. (take_image satellite1 star5 instrument2 infrared1)
   added: (have_image star5 infrared1)
   goals met: 17 of 18
44. (turn_to satellite0 planet21 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet21)
   goals met: 18 of 18
